In [1]:
import pandas as pd
import numpy as np
df1=pd.DataFrame({'form_to':['LonDon_Paris','MAdrid_miLAN','londON_StockhOLm','Budapest_PaRis','Brussels_londOn'],
               'Flightnumber':[10045,np.nan,10065,np.nan,10085],
              'RecentDelays':[[23,45],[],[24,43,87],[13],[67,32]],
              'Airline':['KLM(!)','<Air France> (12)','British Airways','12. Air France','''Swiss Air''']})
df1

            form_to  Flightnumber  RecentDelays            Airline
0      LonDon_Paris       10045.0      [23, 45]             KLM(!)
1      MAdrid_miLAN           NaN            []  <Air France> (12)
2  londON_StockhOLm       10065.0  [24, 43, 87]    British Airways
3    Budapest_PaRis           NaN          [13]     12. Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

In [2]:

df1['Flightnumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: Flightnumber, dtype: float64

In [4]:
df1['Flightnumber'].fillna(value=df1['Flightnumber'][0]+10)

0    10045.0
1    10055.0
2    10065.0
3    10055.0
4    10085.0
Name: Flightnumber, dtype: float64

In [5]:
df1

            form_to  Flightnumber  RecentDelays            Airline
0      LonDon_Paris       10045.0      [23, 45]             KLM(!)
1      MAdrid_miLAN           NaN            []  <Air France> (12)
2  londON_StockhOLm       10065.0  [24, 43, 87]    British Airways
3    Budapest_PaRis           NaN          [13]     12. Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

In [7]:
df1['Flightnumber'].fillna(value=df1['Flightnumber'][0]+10,limit=1)

0    10045.0
1    10055.0
2    10065.0
3        NaN
4    10085.0
Name: Flightnumber, dtype: float64

In [9]:
df1

            form_to  Flightnumber  RecentDelays            Airline
0      LonDon_Paris       10045.0      [23, 45]             KLM(!)
1      MAdrid_miLAN           NaN            []  <Air France> (12)
2  londON_StockhOLm       10065.0  [24, 43, 87]    British Airways
3    Budapest_PaRis           NaN          [13]     12. Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

In [11]:
df1['Flightnumber'].fillna(value=df1['Flightnumber'][0]+10,limit=1,inplace=True)

In [12]:
df1

            form_to  Flightnumber  RecentDelays            Airline
0      LonDon_Paris       10045.0      [23, 45]             KLM(!)
1      MAdrid_miLAN       10055.0            []  <Air France> (12)
2  londON_StockhOLm       10065.0  [24, 43, 87]    British Airways
3    Budapest_PaRis           NaN          [13]     12. Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

In [17]:
df1['Flightnumber'].fillna(value=df1['Flightnumber'][2]+10,limit=1,inplace=True)

In [18]:
 df1

            form_to  Flightnumber  RecentDelays            Airline
0      LonDon_Paris       10045.0      [23, 45]             KLM(!)
1      MAdrid_miLAN       10055.0            []  <Air France> (12)
2  londON_StockhOLm       10065.0  [24, 43, 87]    British Airways
3    Budapest_PaRis       10075.0          [13]     12. Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

In [19]:
df2=df1['form_to'].str.split('_')

In [203]:

temp_data = pd.DataFrame(df['From_To'].str.split('_', 1).to_list(), columns = ['From','To'])

KeyError: 'From_To'

In [20]:
df2

0        [LonDon, Paris]
1        [MAdrid, miLAN]
2    [londON, StockhOLm]
3      [Budapest, PaRis]
4     [Brussels, londOn]
Name: form_to, dtype: object

In [21]:
df2=df1['form_to'].str.split('_',expand=True)

In [22]:
df22=pd.DataFrame(df1['form_to'].str.split('_',expand=True))

In [23]:
df22.columns=['From','To']

In [24]:
df22.columns

Index(['From', 'To'], dtype='object')

In [25]:
df22['From']

0      LonDon
1      MAdrid
2      londON
3    Budapest
4    Brussels
Name: From, dtype: object

In [26]:
df22['To']

0        Paris
1        miLAN
2    StockhOLm
3        PaRis
4       londOn
Name: To, dtype: object

In [27]:
df22['From']=df22['From'].str.capitalize()

In [28]:
df22['To']=df22['To'].str.capitalize()

In [29]:
df22

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [30]:
df1

            form_to  Flightnumber  RecentDelays            Airline
0      LonDon_Paris       10045.0      [23, 45]             KLM(!)
1      MAdrid_miLAN       10055.0            []  <Air France> (12)
2  londON_StockhOLm       10065.0  [24, 43, 87]    British Airways
3    Budapest_PaRis       10075.0          [13]     12. Air France
4   Brussels_londOn       10085.0      [67, 32]          Swiss Air

In [31]:
df1.drop(columns='form_to',  inplace=True)

In [32]:
df1

   Flightnumber  RecentDelays            Airline
0       10045.0      [23, 45]             KLM(!)
1       10055.0            []  <Air France> (12)
2       10065.0  [24, 43, 87]    British Airways
3       10075.0          [13]     12. Air France
4       10085.0      [67, 32]          Swiss Air

In [177]:
type(df22)

pandas.core.frame.DataFrame

In [181]:
type(df1)

pandas.core.frame.DataFrame

In [219]:
df1

   Flightnumber  RecentDelays            Airline
0       10045.0      [23, 45]             KLM(!)
1       10055.0            []  <Air France> (12)
2       10065.0  [24, 43, 87]    British Airways
3       10055.0          [13]     12. Air France
4       10085.0      [67, 32]          Swiss Air

In [ ]:
df.drop(['From_To'], inplace=True, axis=1)

In [220]:
df3=df1

In [221]:
df1

   Flightnumber  RecentDelays            Airline
0       10045.0      [23, 45]             KLM(!)
1       10055.0            []  <Air France> (12)
2       10065.0  [24, 43, 87]    British Airways
3       10055.0          [13]     12. Air France
4       10085.0      [67, 32]          Swiss Air

In [222]:
df3

   Flightnumber  RecentDelays            Airline
0       10045.0      [23, 45]             KLM(!)
1       10055.0            []  <Air France> (12)
2       10065.0  [24, 43, 87]    British Airways
3       10055.0          [13]     12. Air France
4       10085.0      [67, 32]          Swiss Air

In [33]:
df1=pd.concat([df1,df22],axis=1)

In [34]:
df1

   Flightnumber  RecentDelays            Airline      From         To
0       10045.0      [23, 45]             KLM(!)    London      Paris
1       10055.0            []  <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]    British Airways    London  Stockholm
3       10075.0          [13]     12. Air France  Budapest      Paris
4       10085.0      [67, 32]          Swiss Air  Brussels     London

In [35]:
delays = pd.DataFrame(df1['RecentDelays'].to_list(), columns = ['delay_1', 'delay_2', 'delay_3'])
delays

   delay_1  delay_2  delay_3
0     23.0     45.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [36]:
df1.drop(['RecentDelays'], inplace=True, axis=1)

In [37]:
df1

   Flightnumber            Airline      From         To
0       10045.0             KLM(!)    London      Paris
1       10055.0  <Air France> (12)    Madrid      Milan
2       10065.0    British Airways    London  Stockholm
3       10075.0     12. Air France  Budapest      Paris
4       10085.0          Swiss Air  Brussels     London

In [38]:
df1=pd.concat([df1,delays],axis=1)

In [39]:
df1

,Flightnumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM(!),London,Paris,23.0,45.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,Swiss Air,Brussels,London,67.0,32.0,NaN